Revit 2027 API
Curve.Distance Method
Returns the shortest distance from the specified point to this curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Distance(
	XYZ point
)
Public Function Distance (
	point As XYZ
) As Double
public:
double Distance(
	XYZ^ point
)
member Distance :
        point : XYZ -> float
Parameters
point XYZ
The specified point.
Return Value
Double
The real number equal to the shortest distance.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when failed to find the closest point on the curve.
Remarks
Returns the distance from the closest point on the curve to the specified point.
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace